In [2]:
import pandas as pd
import numpy as np

filename = pd.read_excel("titanic3.xls")
df = pd.DataFrame(filename)

In [3]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
avg_age = df['age'].mean()

avg_age

29.8811345124283

In [6]:
age_sex = df['age'].groupby(df['sex'])

age_sex.mean()

sex
female    28.687071
male      30.585233
Name: age, dtype: float64

In [7]:
age_survive = df['age'].groupby(df['survived'])

age_survive.mean()

survived
0    30.545369
1    28.918228
Name: age, dtype: float64

In [9]:
age_embark = df['age'].groupby(df['embarked'])

age_embark.mean()

embarked
C    32.332154
Q    28.630000
S    29.245205
Name: age, dtype: float64

In [11]:
age_class = df['age'].groupby(df['pclass'])

age_class.mean()

pclass
1    39.159918
2    29.506705
3    24.816367
Name: age, dtype: float64

In [15]:
df['pclass'].groupby(df['pclass']).count()

pclass
1    323
2    277
3    709
Name: pclass, dtype: int64

In [16]:
fare_class = df['fare'].groupby(df['pclass'])

fare_class.mean()

pclass
1    87.508992
2    21.179196
3    13.302889
Name: fare, dtype: float64

In [20]:
fare_class_sex = df.groupby(['pclass', 'sex'])['fare']

fare_class_sex.mean()

pclass  sex
1       female    109.412385
        male       69.888385
2       female     23.234827
        male       19.904946
3       female     15.324250
        male       12.415462
Name: fare, dtype: float64